//******************************************************************************
//******************************************************************************
//**                                                                          **
//** Copyright(C) 2020-2021, XCradle Electronic Information Industry Co., Ltd. **
//**                                                                          **
//**                          All Rights Reserved.                            **
//**                                                                          **
//******************************************************************************
//******************************************************************************

//******************************************************************************
// [File] XCradleChsCsm.uni
// [Description] Add XCradle Chinese STR define in this file
// [Author] JSY-ZZP
// [Date] 2021/02/25
//******************************************************************************
/=#
#langdef   x-AMI "x-AMI"
#langdef   en-US "English"
#langdef   zh-chs "中文 (简体)"

#string STR_CSM_FORM                    #language zh-chs "兼容模式配置"
#string STR_CSM_FORM_HELP               #language zh-chs "兼容模式：启用/禁用，Option ROM的执行设置等"
#string STR_CSM_TITLE                   #language zh-chs "兼容性支持模块设置"
#string STR_CSM_I19_TRAP                #language zh-chs "INT19中断捕捉信号响应"
#string STR_CSM_I19_TRAP_IMMEDIATE      #language zh-chs "立即"
#string STR_CSM_I19_TRAP_POSTPONED      #language zh-chs "延时"
#string STR_CSM_I19_TRAP_HELP           #language zh-chs "BIOS对Option ROM INT19中断捕捉信号的响应：立即-立即执行捕捉信号；延时-在传统启动时执行捕捉信号。"
#string STR_CSM_GA20_ACTIVE             #language zh-chs "GateA20控制模式设置"
#string STR_CSM_GA20_ACTIVE_UPONREQUEST #language zh-chs "基于需要"
#string STR_CSM_GA20_ACTIVE_ALWAYS      #language zh-chs "总是"
#string STR_CSM_GA20_ACTIVE_HELP        #language zh-chs "基于需要 - 可以通过BIOS服务程序禁用A20 Gate。总是：不允许禁用A20 Gate；当运行时代码需要在1M以上空间运行时需要该选项"
#string STR_CSM_SUPPORT_PROMPT          #language zh-chs "兼容模式支持"
#string STR_CSM_SUPPORT_HELP            #language zh-chs "启用或禁用兼容模式支持。"
#string STR_BOOT_OPTION_FILTERING_POLICY                    #language zh-chs "引导选项过滤器"
#string STR_BOOT_OPTION_FILTERING_POLICY_HELP               #language zh-chs "该选项控制系统传统或UEFI ROM的优先级"
#string STR_BOOT_OPTION_FILTERING_POLICY_ALL                #language zh-chs "UEFI与传统双模式"
#string STR_BOOT_OPTION_FILTERING_POLICY_LEGACY_ONLY        #language zh-chs "传统模式"
#string STR_BOOT_OPTION_FILTERING_POLICY_UEFI_ONLY          #language zh-chs "UEFI模式"
#string STR_CSM_OPROM_POLICY            #language zh-chs "Option ROM执行策略"
#string STR_PXE_OPROM_POLICY                                #language zh-chs "网卡"
#string STR_PXE_OPROM_POLICY_HELP                           #language zh-chs "网卡PXE Option Rom执行方式设置"
#string STR_MASS_STORAGE_OPROM_POLICY                       #language zh-chs "存储设备"
#string STR_MASS_STORAGE_OPROM_POLICY_HELP                  #language zh-chs "存储设备 Option Rom执行方式设置"
#string STR_VIDEO_OPROM_POLICY                              #language zh-chs "视频"
#string STR_VIDEO_OPROM_POLICY_HELP                         #language zh-chs "视频设备Option Rom执行方式设置"
#string STR_OPROM_POLICY_DISABLE                            #language zh-chs "不执行"
#string STR_OPROM_POLICY_UEFI_ONLY                          #language zh-chs "UEFI"
#string STR_OPROM_POLICY_LEGACY_ONLY                        #language zh-chs "传统模式"
#string STR_OLD_OPROM_LAUNCH_POLICY                         #language zh-chs "其他PCI设备"
#string STR_OLD_OPROM_LAUNCH_POLICY_HELP                    #language zh-chs "除了网卡、存储、视频等设备，其他PCI设备Option Rom执行方式设置"
#string STR_CSM_HDD_ORDER_ADJUSTMENT                        #language zh-chs "硬盘连接顺序"
#string STR_CSM_HDD_ORDER_ADJUSTMENT_HELP                   #language zh-chs "某些OS需求调整硬盘句柄，OS安装在驱动器80h"
#string STR_CSM_ADJUST_HDD_ORDER                            #language zh-chs "调整"
#string STR_CSM_KEEP_HDD_ORDER                              #language zh-chs "保持"

//******************************************************************************
//******************************************************************************
//**                                                                          **
//** Copyright(C) 2020-2021, XCradle Electronic Information Industry Co., Ltd. **
//**                                                                          **
//**                          All Rights Reserved.                            **
//**                                                                          **
//******************************************************************************
//******************************************************************************